/* eslint-disable ts/prefer-literal-enum-member */

/**
 * 按位或（|）运算符：在其中一个或两个操作数对应的二进制位为 1 时，该位的结果值为 1。
 *      9 (十进制) = 00000000000000000000000000001001 (二进制)
 *     14 (十进制) = 00000000000000000000000000001110 (二进制)
 *                  --------------------------------
 * 14 | 9 (十进制) = 00000000000000000000000000001111 (二进制) = 15 (十进制)
 *
 * 按位与（&）运算符：在两个操作数对应的二进位都为 1 时，该位的结果值才为 1。
 *      9 (十进制) = 00000000000000000000000000001001 (二进制)
 *     14 (十进制) = 00000000000000000000000000001110 (二进制)
 *                  --------------------------------
 * 14 & 9 (十进制) = 00000000000000000000000000001000 (二进制) = 8 (十进制)
 *
 * 左移操作符 (<<) ：将第一个操作数向左移动指定位数，左边超出的位数将会被清除，右边将会补零。
 *      9 (十进制) = 00000000000000000000000000001001 (二进制)
 *                  --------------------------------
 * 9 << 2 (十进制) = 00000000000000000000000000100100 (二进制) = 36 (十进制)
 */

export enum ShapeFlags {
  ELEMENT = 1, // 普通的 DOM 元素
  FUNCTIONAL_COMPONENT = 1 << 1, // 函数式组件（Functional Component）
  STATEFUL_COMPONENT = 1 << 2, // 有状态的组件（Stateful Component）
  TEXT_CHILDREN = 1 << 3, // 文本节点
  ARRAY_CHILDREN = 1 << 4, // 数组类型
  SLOTS_CHILDREN = 1 << 5, // 插槽内容（Slots）
  TELEPORT = 1 << 6, // Teleport 组件：允许将子节点移动到 DOM 的其他部分
  SUSPENSE = 1 << 7, // Suspense 组件：用于等待异步内容的加载，常与异步组件一起使用
  COMPONENT_SHOULD_KEEP_ALIVE = 1 << 8, // 组件应当被缓存，即使它从 DOM 中移除也应该保留其状态。这是 keep-alive 的一个标志
  COMPONENT_KEPT_ALIVE = 1 << 9, // 组件已经被缓存，表示已经通过 keep-alive 保留的组件
  COMPONENT = ShapeFlags.STATEFUL_COMPONENT | ShapeFlags.FUNCTIONAL_COMPONENT, // 组件，代表着该节点可以是有状态的组件或函数式组件
}
